Repository: oxygenxml/blog
Catalog: translations/xliff/2nd translation/translated/oxygen_xml_blog_ro.ditamap.tmx
Source language: en
Languages: ro

source: The presentation below enumerates various useful AI-related actions and checks how they interact with DITA XML content, especially with DITA XML features such as specialization, content reuse, or filtering. It all considers how the AI actions can be made more DITA XML-aware to be better integrated with a particular organization's needs.
ro: Prezentarea de mai jos enumeră diverse acțiuni utile legate de AI și verifică modul în care acestea interacționează cu conținutul DITA XML, în special cu funcționalități precum specializarea, reutilizarea conținutului sau filtrarea. Totul are în vedere modul în care acțiunile AI pot fi făcute mai conștiente de DITA XML pentru a fi mai bine integrate cu nevoile specifice ale unei organizații.

source: Providing content to AI engines using DITA OT plugins
ro: Furnizarea de conținut către motoarele AI folosind pluginuri DITA OT

source: As part of the DITA Open Toolkit Day 2025 conference in Copenhagen, I presented a couple of DITA Open Toolkit plugins I developed that can use AI or provide content to be used by the AI:
ro: În cadrul conferinței DITA Open Toolkit Day 2025 din Copenhaga, am prezentat câteva pluginuri DITA Open Toolkit pe care le-am dezvoltat și care pot folosi AI sau pot furniza conținut pentru a fi utilizat de AI:

source: DITA OT plugin to preprocess using AI to apply AI in the DITA OT pre-processing stage (for example, to translate content at publishing time).
ro: Plugin DITA OT pentru preprocesare cu ajutorul AI, aplicând AI în etapa de pre-procesare DITA OT (de exemplu, pentru traducerea conținutului la momentul publicării).

source: DITA OT plugin to apply AI validation rules on pre-processed content (with conrefs expanded) and create a report.
ro: Plugin DITA OT pentru aplicarea regulilor de validare AI pe conținutul pre-procesat (cu conrefs expandate) și generarea unui raport.

source: DITA OT plugin to create content using AI from a Style Guide, fine-tuning JSONL content for the AI.
ro: Plugin DITA OT pentru generarea de conținut cu ajutorul AI pornind de la un Style Guide, creând conținut JSONL pentru fine-tuning-ul AI-ului.

source: DITA OT plugin to upload Markdown content to an AI Assistant vector store.
ro: Plugin DITA OT pentru încărcarea conținutului Markdown într-un vector store al unui AI Assistant.

source: DITA OT Summarize plugin to create a summary of an entire DITA map in markdown.
ro: Pluginul DITA OT Summarize pentru a crea un rezumat al întregii hărți DITA în format markdown.

source: If you find any of these subjects interesting, the entire set of slides is attached below. You can also use the feedback form if you want to have discussions about any of these plugins.
ro: Dacă găsiți oricare dintre aceste subiecte interesante, întregul set de slide-uri este atașat mai jos. De asemenea, puteți folosi formularul de feedback dacă doriți să purtați discuții despre oricare dintre aceste pluginuri.

source: Embedding Diagrams in DITA Topics Using Mermaid
ro: Înglobarea diagramelor în topicuri DITA folosind Mermaid

source: DITA Diagrams DITA Publishing Customization
ro: Diagrame DITA Personalizare publicare DITA

source: Mermaid is a neat library that takes textual descriptions of diagrams and produces visual diagrams from them.
ro: Mermaid este o bibliotecă interesantă care preia descrieri textuale ale diagramelor și generează din acestea diagrame vizuale.

source: Suppose you have a DITA topic that embeds such a textual description of a diagram: .
ro: Presupuneți că aveți un topic DITA care înglobează o astfel de descriere textuală a unei diagrame: .

source: To provide support in Oxygen for publishing to HTML using such diagrams in DITA topics, you need to install this free publishing plugin that, once installed in the DITA Open Toolkit, will convert the textual descriptions to SVG diagrams for both the HTML-based and PDF outputs: .
ro: Pentru a oferi suport în Oxygen pentru publicarea în HTML folosind astfel de diagrame în topicuri DITA, trebuie să instalați acest plugin gratuit de publicare care, odată instalat în DITA Open Toolkit, va converti descrierile textuale în diagrame SVG atât pentru output-urile HTML, cât și PDF: .

source: You can preview the created diagrams using the Mermaid live editor: .
ro: Puteți previzualiza diagramele create folosind editorul live Mermaid: .

source: Embedding Diagrams in DITA topics using PlantUML
ro: Înglobarea diagramelor în topicuri DITA folosind PlantUML

source: PlantUML is a neat library that takes textual descriptions of diagrams and produces visual diagrams from them.
ro: PlantUML este o bibliotecă interesantă care preia descrieri textuale ale diagramelor și generează din acestea diagrame vizuale.

source: To provide support in Oxygen for using such diagrams in DITA topics, you need to install the following components:
ro: Pentru a oferi suport în Oxygen pentru utilizarea unor astfel de diagrame în topicuri DITA, trebuie să instalați următoarele componente:

source: An Oxygen plugin that presents PlantUML textual descriptions as images when editing the content in the Author visual editing mode: .
ro: Un plugin Oxygen care prezintă descrierile textuale PlantUML ca imagini atunci când editați conținutul în modul de editare vizuală Author : .

source: A DITA Open Toolkit publishing plugin that, once installed in the DITA Open Toolkit, will convert the textual descriptions to diagrams for both the HTML-based and PDF outputs: .
ro: Un plugin de publicare pentru DITA Open Toolkit care, odată instalat în DITA Open Toolkit, va converti descrierile textuale în diagrame atât pentru output-urile HTML, cât și PDF: .

source: Once you have this setup, you can both visualize the diagrams when editing and publish them while having the diagram representations dynamically converted to SVG in the published output.
ro: Odată ce ați realizat această configurare, puteți atât să vizualizați diagramele în timpul editării, cât și să le publicați, având reprezentările diagramelor convertite dinamic în SVG în output-ul publicat.

source: Utilizing GenAI to Enhance Early-Stage Technical Content Creation (Presentation)
ro: Utilizarea GenAI pentru îmbunătățirea creării de conținut tehnic în faza incipientă (Prezentare)

source: Generative Artificial Intelligence (GenAI) is a category of AI focused on creating content (text, images, videos, music, etc.), as opposed to traditional AI, which aims primarily at understanding or classifying data. And in the early-stages of writing technical documentation, GenAI can be used for at least two purposes:
ro: Inteligența Artificială Generativă (GenAI) este o categorie de AI axată pe crearea de conținut (text, imagini, videoclipuri, muzică etc.), spre deosebire de AI-ul tradițional, care urmărește în principal înțelegerea sau clasificarea datelor. Iar în etapele incipiente ale redactării documentației tehnice, GenAI poate fi folosită cel puțin în două scopuri:

source: Generating a documentation draft from scratch.
ro: Generarea unei schițe de documentație de la zero.

source: Updating the existing text content based on recent changes in a product.
ro: Actualizarea conținutului text existent pe baza modificărilor recente ale unui produs.

source: I've created a presentation titled Utilizing GenAI to Enhance Early-Stage Technical Content Creation about how generative AI can enhance your productivity in the early-stage technical content creation, and I've included this presentation below for our clients and integrators to gain a better understanding of the AI-Powered XML Editing tools we offer.
ro: Am realizat o prezentare intitulată Utilizarea GenAI pentru îmbunătățirea creării de conținut tehnic în faza incipientă despre modul în care AI-ul generativ vă poate crește productivitatea în etapa inițială a creării de conținut tehnic și am inclus această prezentare mai jos pentru ca clienții și integratorii noștri să înțeleagă mai bine instrumentele de editare XML bazate pe AI pe care le oferim.

source: Generating Google Structured Data from your DITA frequently asked questions
ro: Generarea datelor structurate Google din întrebările frecvente DITA

source: Google Structured Data DITA Publishing Customization
ro: Date structurate Google Personalizare publicare DITA

source: HTML pages published on the web can contain metadata specified using the Google Structured Data specification. Once such metadata exists in an HTML page, the Google search engine can present, for example, lists of frequently asked questions directly in the search page without the need to open the target HTML page. Below is a set of steps for automatically generating Google Structured Data metadata for DITA frequently asked questions when publishing DITA content to Oxygen WebHelp Responsive output, which can be customized using a publishing template mechanism .
ro: Paginile HTML publicate pe web pot conține metadate specificate folosind specificația Google Structured Data . Odată ce astfel de metadate există într-o pagină HTML, motorul de căutare Google poate prezenta, de exemplu, liste de întrebări frecvente direct în pagina de rezultate a căutării, fără a fi nevoie să deschideți pagina HTML țintă. Mai jos este prezentat un set de pași pentru generarea automată a metadatelor Google Structured Data pentru întrebările frecvente DITA atunci când publicați conținut DITA în output Oxygen WebHelp Responsive, care poate fi personalizat folosind un mecanism de șablon de publicare .

source: In your DITA project, create a topic with a specific outputclass attribute value to signal that you want the Google structured data to be automatically generated for it.
ro: În proiectul dumneavoastră DITA, creați un topic cu o valoare specifică a atributului outputclass pentru a semnala că doriți ca datele structurate Google să fie generate automat pentru acesta.

source: Inside a WebHelp publishing template folder, there is an opt file that can contain links to various XSLT stylesheets that are useful for customizations. For example, we'll add a link to a stylesheet for processing such special DITA topics and producing a special script that contains details for each question/answer pair.
ro: Într-un folder de șablon de publicare WebHelp există un fișier opt care poate conține legături către diverse foi de stil XSLT utile pentru personalizări. De exemplu, vom adăuga o legătură către o foaie de stil pentru procesarea acestor topicuri DITA speciale și generarea unui script special care conține detalii pentru fiecare pereche întrebare/răspuns.

source: Create the addGoogleStructuredData.xsl XSLT stylesheet that processes the task contents and adds a script in the HTML head that contains the frequently asked questions in Google Structured Data format.
ro: Creați foaia de stil XSLT addGoogleStructuredData.xsl care procesează conținutul task-ului și adaugă un script în head-ul HTML ce conține întrebările frecvente în format Google Structured Data.

source: Publish the DITA XML Content to a web site using the WebHelp Responsive transformation.
ro: Publicați conținutul DITA XML pe un site web folosind transformarea WebHelp Responsive .

source: Test your HTML page using the Google Rich Results Tester: .
ro: Testați pagina HTML folosind Google Rich Results Tester: .

source: Once Google indexes your page, google search for it.
ro: După ce Google indexează pagina, căutați-o pe Google.

source: Generating Google Structured Data from your DITA tasks
ro: Generarea datelor structurate Google din task-urile DITA

source: HTML pages published on the web can contain metadata specified using the Google Structured Data specification. Once such metadata exists in an HTML page, the Google search engine can present, for example, steps to complete a certain task directly in the search page without the need to open the target HTML page. Below is a set of steps for automatically generating Google Structured Data metadata for DITA tasks when publishing DITA content to Oxygen WebHelp Responsive output, which can be customized using a publishing template mechanism .
ro: Paginile HTML publicate pe web pot conține metadate specificate folosind specificația Google Structured Data . Odată ce astfel de metadate există într-o pagină HTML, motorul de căutare Google poate prezenta, de exemplu, pașii pentru a finaliza o anumită sarcină direct în pagina de rezultate a căutării, fără a fi nevoie să deschideți pagina HTML țintă. Mai jos este prezentat un set de pași pentru generarea automată a metadatelor Google Structured Data pentru task-urile DITA atunci când publicați conținut DITA în output Oxygen WebHelp Responsive, care poate fi personalizat folosind un mecanism de șablon de publicare .

source: In your DITA project, create a task type of topic with a specific outputclass attribute value to signal that you want the Google structured data to be automatically generated for it.
ro: În proiectul dumneavoastră DITA, creați un topic de tip task cu o valoare specifică a atributului outputclass pentru a semnala că doriți ca datele structurate Google să fie generate automat pentru acesta.

source: Inside a WebHelp publishing template folder, there is an opt file that can contain links to various XSLT stylesheets that are useful for customizations. For example, we'll add a link to a stylesheet for processing such special tasks and producing a special script that contains details for each step.
ro: Într-un folder de șablon de publicare WebHelp există un fișier opt care poate conține legături către diverse foi de stil XSLT utile pentru personalizări. De exemplu, vom adăuga o legătură către o foaie de stil pentru procesarea acestor task-uri speciale și generarea unui script special care conține detalii pentru fiecare pas.

source: Create the addGoogleStructuredData.xsl XSLT stylesheet that processes the task contents and adds in the HTML head a script that contains the steps in Google Structured Data format.
ro: Creați foaia de stil XSLT addGoogleStructuredData.xsl care procesează conținutul task-ului și adaugă în head-ul HTML un script ce conține pașii în format Google Structured Data.

source: Publish the DITA XML Content to a web site.
ro: Publicați conținutul DITA XML pe un site web.

source: AI-Powered XML Editing (Presentation)
ro: Editare XML bazată pe AI (Prezentare)

source: We have developed AI-based tools that we believe will greatly benefit technical documentation writers. These tools are designed to enhance the editing experience and provide AI-powered assistance for published documentation.
ro: Am dezvoltat instrumente bazate pe AI care, considerăm noi, vor aduce beneficii semnificative creatorilor de documentație tehnică. Aceste instrumente sunt concepute pentru a îmbunătăți experiența de editare și pentru a oferi asistență bazată pe AI pentru documentația publicată.

source: George Bina has created a presentation titled ' AI-Powered XML Editing ', which offers a comprehensive overview of the key AI-related features we've implemented in our application over recent years. I've included this presentation below for our clients and integrators to gain a better understanding of the AI-Powered XML Editing tools we offer.
ro: George Bina a realizat o prezentare intitulată „ Editare XML bazată pe AI ”, care oferă o prezentare cuprinzătoare a principalelor funcționalități AI pe care le-am implementat în aplicația noastră în ultimii ani. Am inclus această prezentare mai jos pentru ca clienții și integratorii noștri să înțeleagă mai bine instrumentele de editare XML bazate pe AI pe care le oferim.

source: Presenting DITA Task Steps as Diagrams
ro: Prezentarea pașilor unei sarcini DITA sub formă de diagrame

source: DITA Publishing Customization
ro: Personalizare publicare DITA

source: By using our free DITA Open Toolkit plugin, you can embed diagram text descriptions (either in PlantUML or Mermaid format) in DITA topics and have them rendered as diagram images in the published output.
ro: Folosind pluginul nostru gratuit pentru DITA Open Toolkit, puteți încorpora descrieri textuale de diagrame (fie în format PlantUML sau Mermaid ) în topicuri DITA și le puteți reda ca imagini de diagramă în output-ul publicat.

source: I experimented with dynamically constructing diagrams (using the Mermaid framework) for DITA tasks at the time of publishing.
ro: Am experimentat construirea dinamică a diagramelor (folosind framework-ul Mermaid ) pentru sarcinile DITA la momentul publicării.

source: Suppose you have a DITA task with a set of steps.
ro: Presupuneți că aveți o sarcină DITA cu un set de pași.

source: <steps> <step> <cmd>Begin by cutting out all the dead branches.</cmd> <substeps> <substep> <cmd>Find shears</cmd> </substep> .... </substeps> </step> <step> <cmd>Remove all tangled or crossed over branches. This allows air to circulate and reduces bug and fungi infestation. </cmd> </step> ....... </steps>
ro: <steps> <step> <cmd>Începeți prin a tăia toate ramurile uscate.</cmd> <substeps> <substep> <cmd>Găsiți foarfeca de tăiat</cmd> </substep> .... </substeps> </step> <step> <cmd>Îndepărtați toate ramurile încâlcite sau care se suprapun. Acest lucru permite circulația aerului și reduce infestarea cu insecte și ciuperci. </cmd> </step> ....... </steps>

source: A DITA Open Toolkit plugin can use an XSLT customization to dynamically create a Mermaid text diagram representation from the DITA task steps:
ro: Un plugin DITA Open Toolkit poate folosi o personalizare XSLT pentru a crea dinamic o reprezentare de diagramă text Mermaid din pașii sarcinii DITA:

source: A complete DITA Open Toolkit that contains the customization can be found here: .
ro: Un DITA Open Toolkit complet, care conține această personalizare, poate fi găsit aici: .

source: At the time of publishing, the task's HTML page will contain this diagram inside it:
ro: La momentul publicării, pagina HTML a sarcinii va conține această diagramă în interiorul ei:

source: Using ChatGPT in a DITA XML Project
ro: Utilizarea ChatGPT într-un proiect DITA XML

source: The ChatGPT OpenAI bot has the potential to help with various technical documentation tasks (advice about the standard, small conversions, content generation, writing style, and readability analysis).
ro: Botul ChatGPT OpenAI are potențialul de a ajuta la diverse sarcini de documentație tehnică (sfaturi despre standard, conversii simple, generare de conținut, stil de redactare și analiză a lizibilității).

source: Below, you can see a list of prompts that I gave the bot along with the answers. The prompts to the chatbot are presented as codeblocks.
ro: Mai jos puteți vedea o listă de prompturi pe care le-am dat botului, împreună cu răspunsurile. Prompturile către chatbot sunt prezentate ca blocuri de cod.

source: Advice About DITA XML Standard Use
ro: Sfaturi despre utilizarea standardului DITA XML

source: Ask about the type of DITA links to use in a topic.
ro: Întrebați despre tipul de legături DITA care trebuie folosite într-un topic.

source: Should I use cross references or related links in my DITA XML topic?
ro: Ar trebui să folosesc referințe încrucișate sau legături conexe în topicul meu DITA XML?

source: Ask information about a specific DITA XML element.
ro: Cereți informații despre un anumit element DITA XML.

source: Can I use the DITA XML uicontrol element for company names?
ro: Pot folosi elementul DITA XML uicontrol pentru denumiri de companii?

source: Generate New Content
ro: Generare de conținut nou

source: Instruct ChatGPT to generate DITA content about a very common task.
ro: Instruiți ChatGPT să genereze conținut DITA despre o sarcină foarte comună.

source: Write a small DITA XML task about installing a software application on Windows.
ro: Scrieți o sarcină DITA XML scurtă despre instalarea unei aplicații software pe Windows.

source: Generate a list of index terms from existing DITA XML content.
ro: Generați o listă de termeni de index din conținutul DITA XML existent.

source: Create a DITA XML prolog element containing 5-6 index term elements related to the DITA XML topic below: ....
ro: Creați un element prolog DITA XML care să conțină 5-6 elemente de termeni de index relevante pentru topicul DITA XML de mai jos: ....

source: Simple Conversions
ro: Conversii simple

source: Convert Markdown content to DITA XML topic.
ro: Convertiți conținut Markdown într-un topic DITA XML.

source: Convert this Markdown content to a DITA XML topic: # Getting Started List of steps: - Install application - Login - Perform task
ro: Convertiți acest conținut Markdown într-un topic DITA XML: # Getting Started Listă de pași: - Instalați aplicația - Autentificați-vă - Efectuați sarcina

source: Convert CSV content to DITA XML table.
ro: Convertiți conținutul CSV într-un tabel DITA XML.

source: Convert this CSV content containing headers to a DITA XML table element: Common name,Scientific name,Location,Temperament,Diet,Water,Size,Region of the Aquarium,Breeding Compressiceps,Haplochromis compressiceps,Lake Tanganyika,Territorial,Omnivore,"PH 7.0 - 8.0, Temp. 73 - 77 F",5 inches,Bottom,Hard Frontosa,Cyphotilapia frontosus,Lake Tanganyika,Very peaceful,Omnivore,"PH 7.8 - 8.5, Temp 75F - 82F",14 inches,Middle-Bottom,Medium
ro: Convertiți acest conținut CSV care conține anteturi într-un element tabel DITA XML: Common name,Scientific name,Location,Temperament,Diet,Water,Size,Region of the Aquarium,Breeding Compressiceps,Haplochromis compressiceps,Lake Tanganyika,Territorial,Omnivore,"PH 7.0 - 8.0, Temp. 73 - 77 F",5 inches,Bottom,Hard Frontosa,Cyphotilapia frontosus,Lake Tanganyika,Very peaceful,Omnivore,"PH 7.8 - 8.5, Temp 75F - 82F",14 inches,Middle-Bottom,Medium

source: Writing Style
ro: Stil de redactare

source: Ask what terminology to use in certain cases.
ro: Întrebați ce terminologie să folosiți în anumite cazuri.

source: Should I use for technical documentation the phrase "click a button" or "press a button"?
ro: Ar trebui să folosesc pentru documentație tehnică expresia „click a button” sau „press a button”?

source: Re-phrase documentation provided by engineers using the Microsoft Style Guide style and also change the point of view from first-person to third-person.
ro: Reformulați documentația furnizată de ingineri folosind stilul Microsoft Style Guide și schimbați și persoana din întâi în a treia.

source: Re-phrase the following content to adhere to the Microsoft Style Guide, third person: The action Show only keys with closest relative key scope from DITA Reusable Components / Keys tab was also added to Media tab Settings drop down menu The states of the two actions are synchronized. If you check it in Keys tab will automatically get checked in Media tab
ro: Reformulați următorul conținut pentru a respecta Microsoft Style Guide, persoana a treia: The action Show only keys with closest relative key scope from DITA Reusable Components / Keys tab was also added to Media tab Settings drop down menu The states of the two actions are synchronized. If you check it in Keys tab will automatically get checked in Media tab

source: Translate some notes from the engineer's native language (in this case, Romanian with a mix of English words) to English, re-phrase using the Microsoft Style Guide style, and also change the point of view from first-person to third-person.
ro: Traduceți câteva note din limba maternă a inginerului (în acest caz, română cu un amestec de cuvinte în engleză) în engleză, reformulați folosind stilul Microsoft Style Guide și schimbați și persoana din întâi în a treia.
